Revit 2026 API

# SpatialElementTagOrientation Enumeration

---

An enumerated type listing tag orientation options that are supported by SpatialElementTags.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum SpatialElementTagOrientation
```
```vb
Public Enumeration SpatialElementTagOrientation
```
```cpp
public enum class SpatialElementTagOrientation
```
```fsharp
type SpatialElementTagOrientation
```

| Member name | Value | Description |
| --- | --- | --- |
| Horizontal | 0 | The Orientation of tag is Horizontal. |
| Model | 2 | The Orientation of tag is Model. |
| Vertical | 1 | The Orientation of tag is Vertical. |

#### Reference

Autodesk.Revit.DB Namespace